12/data/attachments/8cebf09ccaaa1165.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_408bef4b-ea0f-4869-9202-5823b89f5637</nif:username>
            <nif:friendToBeAdded>Jeremy_direction_Friend_59592_0</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>